[
    {
        "image": "https://i.ibb.co.com/6RN8gD68/Productivity-Pro.jpg",
        "title": "Productivity Pro",
        "companyName": "Taskify Labs",
        "id": 1,
        "description": "A minimalist task manager that turns messy to-do lists into clear, shareable plans. Create tasks with sub-steps, due dates, and priorities; assign owners and add lightweight approvals. Switch between Kanban, calendar, and timeline to spot bottlenecks. Smart suggestions break large goals into daily actions and auto-roll over unfinished work. Templates let teams reuse recurring checklists for sprints, launches, or content calendars. Keyboard shortcuts keep power-users fast; reminders nudge gently without spam. Work offline on mobile and sync when you are back. Export progress to PDF or CSV, and integrate with Slack for quick capture. Role-based permissions keep private tasks private while keeping the team aligned. A minimalist task manager that turns messy to-do lists into clear, shareable plans. Create tasks with sub-steps, due dates, and priorities; assign owners and add lightweight approvals. Switch between Kanban, calendar, and timeline to spot bottlenecks. Smart suggestions break large goals into daily actions and auto-roll over unfinished work. Templates let teams reuse recurring checklists for sprints, launches, or content calendars. Keyboard shortcuts keep power-users fast; reminders nudge gently without spam. Work offline on mobile and sync when you are back. Export progress to PDF or CSV, and integrate with Slack for quick capture. Role-based permissions keep private tasks private while keeping the team aligned.",
        "size": 42,
        "reviews": 1250,
        "ratingAvg": 4.6,
        "downloads": 23,
        "ratings": [
            { "name": "1 star", "count": 45 },
            { "name": "2 star", "count": 80 },
            { "name": "3 star", "count": 180 },
            { "name": "4 star", "count": 450 },
            { "name": "5 star", "count": 495 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/XrnwzdMT/Cloud-Desk.jpg",
        "title": "CloudDesk",
        "companyName": "Nimbus Technologies",
        "id": 2,
        "description": "A cloud workspace that merges documents, sheets, and chat in a single tab so context never gets lost. Co-edit with live cursors, track versions, and resolve comments with one click. Mention teammates, embed charts that update themselves, and turn meeting notes into action items automatically. Offline mode lets you keep working on flights; changes merge safely when you reconnect. Built-in video clips help explain edits without scheduling a call. Share external links with granular view/comment rights, and watermark sensitive docs. Admins get org-wide search, retention rules, and SSO. Templates for PRDs, design specs, and quarterly plans help teams start faster and stay consistent. A cloud workspace that merges documents, sheets, and chat in a single tab so context never gets lost. Co-edit with live cursors, track versions, and resolve comments with one click. Mention teammates, embed charts that update themselves, and turn meeting notes into action items automatically. Offline mode lets you keep working on flights; changes merge safely when you reconnect. Built-in video clips help explain edits without scheduling a call. Share external links with granular view/comment rights, and watermark sensitive docs. Admins get org-wide search, retention rules, and SSO. Templates for PRDs, design specs, and quarterly plans help teams start faster and stay consistent.",
        "size": 85,
        "reviews": 980,
        "ratingAvg": 4.3,
        "downloads": 18,
        "ratings": [
            { "name": "1 star", "count": 60 },
            { "name": "2 star", "count": 70 },
            { "name": "3 star", "count": 190 },
            { "name": "4 star", "count": 380 },
            { "name": "5 star", "count": 280 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/VYQHFBDM/CodeFlow.webp",
        "title": "CodeFlow",
        "companyName": "DevNexus",
        "id": 3,
        "description": "A fast, modern IDE optimized for JavaScript, Python, and Go that keeps you in flow. AI code completion learns your patterns and suggests tests, docs, and refactors. One-click debugging attaches to local or containerized services; breakpoints sync across sessions. Integrated terminal, task runner, and Git tools mean fewer context switches. Profiles let you swap between lightweight “Focus” and full-power “Debug” setups instantly. Built-in formatter and linter keep code clean by default. Open a cloud dev environment from any branch with ephemeral URLs for reviews. Extensions add frameworks, themes, and database explorers, while workspace settings roam across devices. A fast, modern IDE optimized for JavaScript, Python, and Go that keeps you in flow. AI code completion learns your patterns and suggests tests, docs, and refactors. One-click debugging attaches to local or containerized services; breakpoints sync across sessions. Integrated terminal, task runner, and Git tools mean fewer context switches. Profiles let you swap between lightweight “Focus” and full-power “Debug” setups instantly. Built-in formatter and linter keep code clean by default. Open a cloud dev environment from any branch with ephemeral URLs for reviews. Extensions add frameworks, themes, and database explorers, while workspace settings roam across devices.",
        "size": 125,
        "reviews": 2040,
        "ratingAvg": 4.8,
        "downloads": 52,
        "ratings": [
            { "name": "1 star", "count": 90 },
            { "name": "2 star", "count": 60 },
            { "name": "3 star", "count": 140 },
            { "name": "4 star", "count": 460 },
            { "name": "5 star", "count": 1290 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/yGwdcN6/FitTrack.png",
        "title": "FitTrack",
        "companyName": "VitalCore Health",
        "id": 4,
        "description": "Your all-in-one fitness tracker that balances workouts, recovery, and everyday life. Build routines from expert programs or start simple with auto-progression. Form tips play inline during sets; rest timers adjust based on intensity. Track calories and macros with barcode scan, and sync sleep from your wearable. Adaptive goals shift when you are stressed, traveling, or low on sleep so you do not burn out. Weekly insights highlight PRs, undertrained muscle groups, and recovery windows. Share plans with a coach or friends, join challenges, and earn badges that actually mean progress. Works offline at the gym and syncs later without data loss. Your all-in-one fitness tracker that balances workouts, recovery, and everyday life. Build routines from expert programs or start simple with auto-progression. Form tips play inline during sets; rest timers adjust based on intensity. Track calories and macros with barcode scan, and sync sleep from your wearable. Adaptive goals shift when you are stressed, traveling, or low on sleep so you do not burn out. Weekly insights highlight PRs, undertrained muscle groups, and recovery windows. Share plans with a coach or friends, join challenges, and earn badges that actually mean progress. Works offline at the gym and syncs later without data loss.",
        "size": 58,
        "reviews": 1600,
        "ratingAvg": 4.5,
        "downloads": 43,
        "ratings": [
            { "name": "1 star", "count": 75 },
            { "name": "2 star", "count": 90 },
            { "name": "3 star", "count": 210 },
            { "name": "4 star", "count": 480 },
            { "name": "5 star", "count": 745 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/spVvxk4R/Photo-Craft.png",
        "title": "PhotoCraft",
        "companyName": "PixelForge Studio",
        "id": 5,
        "description": "Pro-grade photo editing in your pocket with layers, curves, masks, and AI selections that find edges perfectly. Remove distractions, change skies, and color-grade with film-style LUTs. Batch-edit entire shoots, save reusable presets, and export to web, print, or social-ready sizes with sharpness tuned per platform. Non-destructive edits keep originals safe; version history lets you explore creative forks without fear. RAW support handles big files smoothly; on-device caching keeps edits snappy. Share review galleries with watermarks and password protection. Tutorials guide new users from auto-enhance to manual mastery, while power tools stay one tap away. Pro-grade photo editing in your pocket with layers, curves, masks, and AI selections that find edges perfectly. Remove distractions, change skies, and color-grade with film-style LUTs. Batch-edit entire shoots, save reusable presets, and export to web, print, or social-ready sizes with sharpness tuned per platform. Non-destructive edits keep originals safe; version history lets you explore creative forks without fear. RAW support handles big files smoothly; on-device caching keeps edits snappy. Share review galleries with watermarks and password protection. Tutorials guide new users from auto-enhance to manual mastery, while power tools stay one tap away.",
        "size": 240,
        "reviews": 2100,
        "ratingAvg": 4.7,
        "downloads": 78,
        "ratings": [
            { "name": "1 star", "count": 95 },
            { "name": "2 star", "count": 120 },
            { "name": "3 star", "count": 250 },
            { "name": "4 star", "count": 600 },
            { "name": "5 star", "count": 1035 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/0jXKPyMB/Edu-Sphere.webp",
        "title": "EduSphere",
        "companyName": "Learnova Inc.",
        "id": 6,
        "description": "An interactive e-learning platform built around momentum. Courses are split into bite-size lessons, each ending with a hands-on quiz or mini project. The path adapts to your strengths and gaps, recommending refreshers only where needed. Mentors review capstone projects with practical feedback. Streaks, reminders, and gentle nudges keep you consistent without pressure. Community spaces host peer discussions and code reviews. Download lessons for offline commutes; sync progress later. Analytics show time spent, accuracy by topic, and readiness for certification. Educators get authoring tools, rubrics, and cohort dashboards to track at scale. An interactive e-learning platform built around momentum. Courses are split into bite-size lessons, each ending with a hands-on quiz or mini project. The path adapts to your strengths and gaps, recommending refreshers only where needed. Mentors review capstone projects with practical feedback. Streaks, reminders, and gentle nudges keep you consistent without pressure. Community spaces host peer discussions and code reviews. Download lessons for offline commutes; sync progress later. Analytics show time spent, accuracy by topic, and readiness for certification. Educators get authoring tools, rubrics, and cohort dashboards to track at scale.",
        "size": 180,
        "reviews": 1320,
        "ratingAvg": 4.4,
        "downloads": 39,
        "ratings": [
            { "name": "1 star", "count": 70 },
            { "name": "2 star", "count": 100 },
            { "name": "3 star", "count": 250 },
            { "name": "4 star", "count": 460 },
            { "name": "5 star", "count": 440 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/G40DygWm/Market-Pilot.jpg",
        "title": "MarketPilot",
        "companyName": "FinEdge Systems",
        "id": 7,
        "description": "Real-time market analytics for retail and pro investors. Build watchlists, screen by fundamentals or technicals, and overlay news sentiment on price. AI highlights unusual volume, insider activity, and earnings drift so you know what to read first. Create rule-based alerts for price, RSI, or custom conditions; get them by push or email. Backtest strategies with clean survivorship-bias-free data and export reports. Heatmaps reveal sector rotation; options chains and IV rank help plan hedges. Integrations push trades to supported brokers. Morning briefs summarize overnight moves; closing wraps explain what actually drove the day. Real-time market analytics for retail and pro investors. Build watchlists, screen by fundamentals or technicals, and overlay news sentiment on price. AI highlights unusual volume, insider activity, and earnings drift so you know what to read first. Create rule-based alerts for price, RSI, or custom conditions; get them by push or email. Backtest strategies with clean survivorship-bias-free data and export reports. Heatmaps reveal sector rotation; options chains and IV rank help plan hedges. Integrations push trades to supported brokers. Morning briefs summarize overnight moves; closing wraps explain what actually drove the day.",
        "size": 95,
        "reviews": 890,
        "ratingAvg": 4.2,
        "downloads": 31,
        "ratings": [
            { "name": "1 star", "count": 55 },
            { "name": "2 star", "count": 95 },
            { "name": "3 star", "count": 200 },
            { "name": "4 star", "count": 290 },
            { "name": "5 star", "count": 250 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/1GxV2qyD/ShopEase.png",
        "title": "ShopEase",
        "companyName": "NextGen Retail",
        "id": 8,
        "description": "A smart storefront that personalizes every step of shopping. Show dynamic collections per visitor, rerank products by intent, and A/B test layouts without code. Recover abandoned carts with timely nudges via email or SMS. Manage inventory, coupons, taxes, and shipping from one dashboard. Real-time analytics show add-to-cart rate, funnel drop-off, and cohort LTV. Built-in reviews and Q&A reduce returns; sizing guides and AR previews increase confidence. Integrate with POS and marketplaces to keep stock accurate everywhere. CDN-backed pages load fast worldwide, and accessibility checks help you meet standards out of the box. A smart storefront that personalizes every step of shopping. Show dynamic collections per visitor, rerank products by intent, and A/B test layouts without code. Recover abandoned carts with timely nudges via email or SMS. Manage inventory, coupons, taxes, and shipping from one dashboard. Real-time analytics show add-to-cart rate, funnel drop-off, and cohort LTV. Built-in reviews and Q&A reduce returns; sizing guides and AR previews increase confidence. Integrate with POS and marketplaces to keep stock accurate everywhere. CDN-backed pages load fast worldwide, and accessibility checks help you meet standards out of the box.",
        "size": 210,
        "reviews": 1750,
        "ratingAvg": 4.6,
        "downloads": 68,
        "ratings": [
            { "name": "1 star", "count": 85 },
            { "name": "2 star", "count": 110 },
            { "name": "3 star", "count": 230 },
            { "name": "4 star", "count": 520 },
            { "name": "5 star", "count": 805 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/ymY7s2hg/Note-Verse.png",
        "title": "NoteVerse",
        "companyName": "MindFlow Labs",
        "id": 9,
        "description": "Cloud-synced notes that embrace every kind of thinking—handwriting, voice memos, sketches, and code blocks. Tag with #topics, link notes bidirectionally, and see a graph of how ideas connect. Fast search finds phrases inside images and PDFs. Turn a note into a task with one tap; due dates and reminders keep it actionable. Offline mode lets you write anywhere; changes sync safely later with conflict resolution. Share pages with teammates for quick feedback; limit access when needed. Daily and weekly review prompts resurface what matters so nothing gets lost in the archive. Cloud-synced notes that embrace every kind of thinking—handwriting, voice memos, sketches, and code blocks. Tag with #topics, link notes bidirectionally, and see a graph of how ideas connect. Fast search finds phrases inside images and PDFs. Turn a note into a task with one tap; due dates and reminders keep it actionable. Offline mode lets you write anywhere; changes sync safely later with conflict resolution. Share pages with teammates for quick feedback; limit access when needed. Daily and weekly review prompts resurface what matters so nothing gets lost in the archive.",
        "size": 76,
        "reviews": 940,
        "ratingAvg": 4.3,
        "downloads": 32,
        "ratings": [
            { "name": "1 star", "count": 55 },
            { "name": "2 star", "count": 85 },
            { "name": "3 star", "count": 210 },
            { "name": "4 star", "count": 350 },
            { "name": "5 star", "count": 240 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/Vc4Gr0Wh/AudioZen.jpg",
        "title": "AudioZen",
        "companyName": "SonicWave Studio",
        "id": 10,
        "description": "Personalized audio that adapts to you, not the other way around. Build spatial profiles tuned to your ears and the room you are in. Create scenes for commute, focus, workout, and sleep that blend EQ, noise control, and dynamic range. Measure listening health: exposure time, peak levels, and safe-listening tips. Calibrate once with test tones; the profile syncs to all your devices and popular players. Share playlists with embedded profiles so friends hear what you intended. Optional head-tracking makes podcasts feel like they are in the room. Works with your existing headphones—no lock-in. Personalized audio that adapts to you, not the other way around. Build spatial profiles tuned to your ears and the room you are in. Create scenes for commute, focus, workout, and sleep that blend EQ, noise control, and dynamic range. Measure listening health: exposure time, peak levels, and safe-listening tips. Calibrate once with test tones; the profile syncs to all your devices and popular players. Share playlists with embedded profiles so friends hear what you intended. Optional head-tracking makes podcasts feel like they are in the room. Works with your existing headphones—no lock-in.",
        "size": 132,
        "reviews": 1600,
        "ratingAvg": 4.7,
        "downloads": 54,
        "ratings": [
            { "name": "1 star", "count": 80 },
            { "name": "2 star", "count": 110 },
            { "name": "3 star", "count": 210 },
            { "name": "4 star", "count": 500 },
            { "name": "5 star", "count": 700 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/whdMYskY/Smart-Home-Plus.png",
        "title": "SmartHome Plus",
        "companyName": "Domotics Corp",
        "id": 11,
        "description": "Control your entire smart home from a single, secure dashboard. Group lights, climate, locks, and cameras into rooms and routines. Automations trigger on time, presence, sunrise, or weather. Guest access grants temporary codes that expire automatically. Local processing keeps critical actions fast even if the internet drops; cloud backup preserves history and settings. Privacy controls let you choose what is stored. Energy insights show which devices waste power and suggest schedule tweaks to save money. Works with major ecosystems and bridges unsupported devices with simple adapters. Control your entire smart home from a single, secure dashboard. Group lights, climate, locks, and cameras into rooms and routines. Automations trigger on time, presence, sunrise, or weather. Guest access grants temporary codes that expire automatically. Local processing keeps critical actions fast even if the internet drops; cloud backup preserves history and settings. Privacy controls let you choose what is stored. Energy insights show which devices waste power and suggest schedule tweaks to save money. Works with major ecosystems and bridges unsupported devices with simple adapters.",
        "size": 190,
        "reviews": 1200,
        "ratingAvg": 4.5,
        "downloads": 41,
        "ratings": [
            { "name": "1 star", "count": 60 },
            { "name": "2 star", "count": 90 },
            { "name": "3 star", "count": 210 },
            { "name": "4 star", "count": 400 },
            { "name": "5 star", "count": 440 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/W4Zkrpbc/Finance-IQ.png",
        "title": "FinanceIQ",
        "companyName": "NovaLedger",
        "id": 12,
        "description": "A personal finance coach that runs quietly in the background. Import transactions automatically, categorize with high accuracy, and spot hidden subscriptions. Set budgets that flex with your pay cycle. Forecast cash flow and simulate “what-if” scenarios before you commit. Savings goals get funded automatically from safe-to-spend calculations. Alerts help you avoid overdrafts and fees; insights suggest better credit utilization and cashback combos. Net-worth and debt payoff views keep long-term progress visible. Export tax-ready reports and share a read-only view with a partner or advisor. A personal finance coach that runs quietly in the background. Import transactions automatically, categorize with high accuracy, and spot hidden subscriptions. Set budgets that flex with your pay cycle. Forecast cash flow and simulate “what-if” scenarios before you commit. Savings goals get funded automatically from safe-to-spend calculations. Alerts help you avoid overdrafts and fees; insights suggest better credit utilization and cashback combos. Net-worth and debt payoff views keep long-term progress visible. Export tax-ready reports and share a read-only view with a partner or advisor.",
        "size": 110,
        "reviews": 1950,
        "ratingAvg": 4.6,
        "downloads": 62,
        "ratings": [
            { "name": "1 star", "count": 95 },
            { "name": "2 star", "count": 130 },
            { "name": "3 star", "count": 210 },
            { "name": "4 star", "count": 520 },
            { "name": "5 star", "count": 995 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/G4ttbmj4/DevMate.png",
        "title": "DevMate",
        "companyName": "Codeverse",
        "id": 13,
        "description": "A collaborative code editor built for pair programming and distributed teams. See your partner is cursor, selections, and terminal output live. Share servers and dev containers securely without port wrangling. Built-in voice and chat keep discussions close to code. Resolve merge conflicts visually; stage hunks and craft commit messages together. Preview PRs in ephemeral environments that mirror production. Session handoff lets teammates continue where you left off. Role-based access ensures guests see only what they should during reviews or interviews. A collaborative code editor built for pair programming and distributed teams. See your partner is cursor, selections, and terminal output live. Share servers and dev containers securely without port wrangling. Built-in voice and chat keep discussions close to code. Resolve merge conflicts visually; stage hunks and craft commit messages together. Preview PRs in ephemeral environments that mirror production. Session handoff lets teammates continue where you left off. Role-based access ensures guests see only what they should during reviews or interviews.",
        "size": 142,
        "reviews": 870,
        "ratingAvg": 4.4,
        "downloads": 26,
        "ratings": [
            { "name": "1 star", "count": 40 },
            { "name": "2 star", "count": 90 },
            { "name": "3 star", "count": 170 },
            { "name": "4 star", "count": 320 },
            { "name": "5 star", "count": 250 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/MDJbWm9n/FoodHub.png",
        "title": "FoodHub",
        "companyName": "QuickEats Network",
        "id": 14,
        "description": "Order from nearby restaurants with live kitchen and driver tracking. See accurate prep times, dietary tags, and allergen info before you add to cart. Group orders split bills automatically; tip suggestions are fair by default. Reorder favorites in one tap. Smart substitutions handle sold-out items without a phone call. Delay delivery until  you are home or schedule ahead for events. Support local with curated lists and transparent fees. Rate each part of the experience—food, packaging, and delivery—to help vendors improve. Order from nearby restaurants with live kitchen and driver tracking. See accurate prep times, dietary tags, and allergen info before you add to cart. Group orders split bills automatically; tip suggestions are fair by default. Reorder favorites in one tap. Smart substitutions handle sold-out items without a phone call. Delay delivery until  you are home or schedule ahead for events. Support local with curated lists and transparent fees. Rate each part of the experience—food, packaging, and delivery—to help vendors improve.",
        "size": 185,
        "reviews": 2220,
        "ratingAvg": 4.5,
        "downloads": 27,
        "ratings": [
            { "name": "1 star", "count": 150 },
            { "name": "2 star", "count": 130 },
            { "name": "3 star", "count": 300 },
            { "name": "4 star", "count": 650 },
            { "name": "5 star", "count": 990 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/xS0P9nnv/Photo-Snap.jpg",
        "title": "PhotoSnap",
        "companyName": "LightFrame Inc.",
        "id": 15,
        "description": "Capture, edit, and share in seconds. One-tap presets get you social-ready; advanced sliders and curves give you full control. AI sky and background replacement create dramatic looks without masks. Albums auto-organize by faces, places, and events. Collaborate on shared albums with comments and reactions. RAW and HEIF support preserve detail; exports target webP, JPEG, or TIFF with tuned sharpening. Batch rename and watermark for client deliveries. Tutorials onboard beginners gently while keeping pro tools close. Capture, edit, and share in seconds. One-tap presets get you social-ready; advanced sliders and curves give you full control. AI sky and background replacement create dramatic looks without masks. Albums auto-organize by faces, places, and events. Collaborate on shared albums with comments and reactions. RAW and HEIF support preserve detail; exports target webP, JPEG, or TIFF with tuned sharpening. Batch rename and watermark for client deliveries. Tutorials onboard beginners gently while keeping pro tools close.",
        "size": 212,
        "reviews": 1420,
        "ratingAvg": 4.3,
        "downloads": 23,
        "ratings": [
            { "name": "1 star", "count": 60 },
            { "name": "2 star", "count": 120 },
            { "name": "3 star", "count": 220 },
            { "name": "4 star", "count": 480 },
            { "name": "5 star", "count": 540 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/Jw0Hnkvs/Health-Sync.png",
        "title": "HealthSync",
        "companyName": "WellTech",
        "id": 16,
        "description": "Health tracking that actually explains the “why.” Monitor heart rate, HRV, stress, steps, and sleep, then translate raw numbers into a daily readiness score. Guided breathing and micro-stretches help you course-correct mid-day. Syncs with major wearables and pulls in workouts automatically. Trends reveal overtraining and burnout risk; recommendations adjust your program before issues build. Share summaries with a coach or physician. Privacy controls default to local processing; you choose what to sync. Health tracking that actually explains the “why.” Monitor heart rate, HRV, stress, steps, and sleep, then translate raw numbers into a daily readiness score. Guided breathing and micro-stretches help you course-correct mid-day. Syncs with major wearables and pulls in workouts automatically. Trends reveal overtraining and burnout risk; recommendations adjust your program before issues build. Share summaries with a coach or physician. Privacy controls default to local processing; you choose what to sync.",
        "size": 156,
        "reviews": 1580,
        "ratingAvg": 4.4,
        "downloads": 52,
        "ratings": [
            { "name": "1 star", "count": 90 },
            { "name": "2 star", "count": 120 },
            { "name": "3 star", "count": 240 },
            { "name": "4 star", "count": 500 },
            { "name": "5 star", "count": 630 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/HDB0WhyF/Career-Bridge.jpg",
        "title": "CareerBridge",
        "companyName": "HireHub Global",
        "id": 17,
        "description": "A career co-pilot from discovery to offer. Explore roles with day-in-the-life breakdowns and salary bands. Generate tailored resumes from your experience, then refine with AI suggestions. Track applications in a pipeline; get alerts when you are a strong match. Practice interviews with role-specific question banks and structured feedback. Network through mentor matching and alumni groups. Analytics show which resume versions and companies respond best so you can iterate with data. A career co-pilot from discovery to offer. Explore roles with day-in-the-life breakdowns and salary bands. Generate tailored resumes from your experience, then refine with AI suggestions. Track applications in a pipeline; get alerts when you are a strong match. Practice interviews with role-specific question banks and structured feedback. Network through mentor matching and alumni groups. Analytics show which resume versions and companies respond best so you can iterate with data.",
        "size": 133,
        "reviews": 1120,
        "ratingAvg": 4.2,
        "downloads": 34,
        "ratings": [
            { "name": "1 star", "count": 70 },
            { "name": "2 star", "count": 100 },
            { "name": "3 star", "count": 220 },
            { "name": "4 star", "count": 420 },
            { "name": "5 star", "count": 310 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/MD8f4HJZ/Book-Verse.jpg",
        "title": "BookVerse",
        "companyName": "InkWorks",
        "id": 18,
        "description": "Your portable library with superpowers. Browse curated lists, discover series, and follow authors. Reading modes adapt for day, night, and dyslexia. Highlight and annotate; export quotes to your notes app with citations. Audiobook sync keeps your place across formats. Offline downloads save long trips. Smart recommendations learn your taste while letting you hide genres you do not want. Family sharing includes kid profiles with age filters and time limits. Your portable library with superpowers. Browse curated lists, discover series, and follow authors. Reading modes adapt for day, night, and dyslexia. Highlight and annotate; export quotes to your notes app with citations. Audiobook sync keeps your place across formats. Offline downloads save long trips. Smart recommendations learn your taste while letting you hide genres you do not want. Family sharing includes kid profiles with age filters and time limits.",
        "size": 250,
        "reviews": 2100,
        "ratingAvg": 4.8,
        "downloads": 44,
        "ratings": [
            { "name": "1 star", "count": 120 },
            { "name": "2 star", "count": 130 },
            { "name": "3 star", "count": 190 },
            { "name": "4 star", "count": 480 },
            { "name": "5 star", "count": 1180 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/BKV30Kbx/Meetly.png",
        "title": "Meetly",
        "companyName": "Connectly Inc.",
        "id": 19,
        "description": "Video meetings that feel light, even on slow connections. Low-latency streams, background noise suppression, and live captions keep discussions clear. One-click recording generates searchable transcripts with speaker labels and action items. Breakout rooms, polls, and reactions keep sessions engaging. Calendar integrations handle scheduling and time zones. Security defaults lock rooms, and guests join easily with restricted permissions. Auto-follow cameras frame speakers naturally without manual control. Video meetings that feel light, even on slow connections. Low-latency streams, background noise suppression, and live captions keep discussions clear. One-click recording generates searchable transcripts with speaker labels and action items. Breakout rooms, polls, and reactions keep sessions engaging. Calendar integrations handle scheduling and time zones. Security defaults lock rooms, and guests join easily with restricted permissions. Auto-follow cameras frame speakers naturally without manual control.",
        "size": 145,
        "reviews": 1340,
        "ratingAvg": 4.5,
        "downloads": 53,
        "ratings": [
            { "name": "1 star", "count": 90 },
            { "name": "2 star", "count": 120 },
            { "name": "3 star", "count": 220 },
            { "name": "4 star", "count": 400 },
            { "name": "5 star", "count": 510 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/rGyM1HX5/Shop-Smart.png",
        "title": "ShopSmart",
        "companyName": "RetailX Labs",
        "id": 20,
        "description": "A shopping co-pilot that saves time and money. Compare prices across stores, see price history graphs, and get coupon suggestions at checkout. Create alerts for restocks and drops. Track shipments automatically and get return reminders before windows close. Privacy mode masks your searches from retailers; shareable lists help coordinate with family. Category-specific filters—fit, material, care—make choosing easier. Insights highlight brands you actually wear and what you rarely use. A shopping co-pilot that saves time and money. Compare prices across stores, see price history graphs, and get coupon suggestions at checkout. Create alerts for restocks and drops. Track shipments automatically and get return reminders before windows close. Privacy mode masks your searches from retailers; shareable lists help coordinate with family. Category-specific filters—fit, material, care—make choosing easier. Insights highlight brands you actually wear and what you rarely use.",
        "size": 210,
        "reviews": 1680,
        "ratingAvg": 4.6,
        "downloads": 9,
        "ratings": [
            { "name": "1 star", "count": 100 },
            { "name": "2 star", "count": 120 },
            { "name": "3 star", "count": 240 },
            { "name": "4 star", "count": 480 },
            { "name": "5 star", "count": 740 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/dJ2dtmJL/PlanIt.png",
        "title": "PlanIt",
        "companyName": "Orbit Solutions",
        "id": 21,
        "description": "Plan events from kickoff to wrap-up. Build timelines, budgets, and vendor lists; assign tasks and see status at a glance. Collect RSVPs with meal preferences and auto-generated seating charts. Share guest passes and mobile tickets. Day-of mode shows the run-of-show with live notifications. Post-event reports summarize costs, attendance, and feedback so your next event is smoother. Templates cover meetups, conferences, and weddings. Plan events from kickoff to wrap-up. Build timelines, budgets, and vendor lists; assign tasks and see status at a glance. Collect RSVPs with meal preferences and auto-generated seating charts. Share guest passes and mobile tickets. Day-of mode shows the run-of-show with live notifications. Post-event reports summarize costs, attendance, and feedback so your next event is smoother. Templates cover meetups, conferences, and weddings.",
        "size": 120,
        "reviews": 910,
        "ratingAvg": 4.2,
        "downloads": 27,
        "ratings": [
            { "name": "1 star", "count": 40 },
            { "name": "2 star", "count": 85 },
            { "name": "3 star", "count": 200 },
            { "name": "4 star", "count": 360 },
            { "name": "5 star", "count": 225 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/XmMDf5X/Learnify.png",
        "title": "Learnify",
        "companyName": "Skillverse",
        "id": 22,
        "description": "Learn in focused sprints with micro-courses and real projects. Lessons are short; checkpoints verify understanding. Peer reviews and mentor office hours move you past roadblocks. Streaks encourage consistency without shaming. Build a portfolio from graded projects with verified badges. Mobile app supports offline study; progress syncs instantly. Educators get cohort dashboards and automatic pacing suggestions. Learn in focused sprints with micro-courses and real projects. Lessons are short; checkpoints verify understanding. Peer reviews and mentor office hours move you past roadblocks. Streaks encourage consistency without shaming. Build a portfolio from graded projects with verified badges. Mobile app supports offline study; progress syncs instantly. Educators get cohort dashboards and automatic pacing suggestions.",
        "size": 188,
        "reviews": 1430,
        "ratingAvg": 4.4,
        "downloads": 39,
        "ratings": [
            { "name": "1 star", "count": 60 },
            { "name": "2 star", "count": 120 },
            { "name": "3 star", "count": 260 },
            { "name": "4 star", "count": 480 },
            { "name": "5 star", "count": 510 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/pjNdyXWH/TravelGo.jpg",
        "title": "TravelGo",
        "companyName": "GlobeTrek",
        "id": 23,
        "description": "Travel planning that’s transparent and flexible. Search flights and stays with real prices—no hidden fees. Filters consider layover length, baggage, and cancellation rules. Price alerts notify you of drops; rebooking helpers find better options when plans change. Smart itineraries collect bookings, maps, and entry requirements in one place. Share with travel companions for live updates. Support chat handles disruptions without long holds. Travel planning that’s transparent and flexible. Search flights and stays with real prices—no hidden fees. Filters consider layover length, baggage, and cancellation rules. Price alerts notify you of drops; rebooking helpers find better options when plans change. Smart itineraries collect bookings, maps, and entry requirements in one place. Share with travel companions for live updates. Support chat handles disruptions without long holds.",
        "size": 240,
        "reviews": 2220,
        "ratingAvg": 4.7,
        "downloads": 26,
        "ratings": [
            { "name": "1 star", "count": 120 },
            { "name": "2 star", "count": 140 },
            { "name": "3 star", "count": 220 },
            { "name": "4 star", "count": 520 },
            { "name": "5 star", "count": 1220 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/8Lgjmr63/Task-Pilot.png",
        "title": "TaskPilot",
        "companyName": "ZenWork",
        "id": 24,
        "description": "Automate repetitive work across tools you already use. Connect email, spreadsheets, CRMs, and ticketing systems. Build workflows visually with triggers and conditions; schedule runs or fire on events. Branching and retries handle edge cases. Templates help you start fast; logs and alerts show exactly what happened. Secrets are stored securely; role permissions keep data safe. Versioning lets you test changes safely before rollout. Automate repetitive work across tools you already use. Connect email, spreadsheets, CRMs, and ticketing systems. Build workflows visually with triggers and conditions; schedule runs or fire on events. Branching and retries handle edge cases. Templates help you start fast; logs and alerts show exactly what happened. Secrets are stored securely; role permissions keep data safe. Versioning lets you test changes safely before rollout.",
        "size": 130,
        "reviews": 1010,
        "ratingAvg": 4.3,
        "downloads": 30,
        "ratings": [
            { "name": "1 star", "count": 50 },
            { "name": "2 star", "count": 90 },
            { "name": "3 star", "count": 210 },
            { "name": "4 star", "count": 360 },
            { "name": "5 star", "count": 300 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/xtJS7kb4/EcoTrack.png",
        "title": "EcoTrack",
        "companyName": "GreenSphere",
        "id": 25,
        "description": "Make greener choices visible and easy. Track your carbon footprint from travel, food, home energy, and shopping. Set reduction goals; weekly challenges suggest swaps with real impact. Connect utility accounts for automatic baseline tracking. Offsets fund verified projects you pick. Neighborhood view shows local transit, recycling, and incentives. Share progress with friends or keep it private. Monthly reports translate tons into understandable equivalents. Make greener choices visible and easy. Track your carbon footprint from travel, food, home energy, and shopping. Set reduction goals; weekly challenges suggest swaps with real impact. Connect utility accounts for automatic baseline tracking. Offsets fund verified projects you pick. Neighborhood view shows local transit, recycling, and incentives. Share progress with friends or keep it private. Monthly reports translate tons into understandable equivalents.",
        "size": 89,
        "reviews": 890,
        "ratingAvg": 4.2,
        "downloads": 27,
        "ratings": [
            { "name": "1 star", "count": 40 },
            { "name": "2 star", "count": 70 },
            { "name": "3 star", "count": 200 },
            { "name": "4 star", "count": 320 },
            { "name": "5 star", "count": 260 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/KpkMP9S3/GameHub.png",
        "title": "GameHub",
        "companyName": "NextPlay Studios",
        "id": 26,
        "description": "A game hub for discovering, playing, and sharing. Stream or download with cloud saves that follow you. Leaderboards and clubs make competition friendly. Parental tools set playtime windows and content filters. Rich profiles show achievements and clips. Cross-platform parties keep friends together. Smart recommendations learn your style—cozy, competitive, story-driven—without trapping you in a bubble. A game hub for discovering, playing, and sharing. Stream or download with cloud saves that follow you. Leaderboards and clubs make competition friendly. Parental tools set playtime windows and content filters. Rich profiles show achievements and clips. Cross-platform parties keep friends together. Smart recommendations learn your style—cozy, competitive, story-driven—without trapping you in a bubble.",
        "size": 290,
        "reviews": 2630,
        "ratingAvg": 4.8,
        "downloads": 12,
        "ratings": [
            { "name": "1 star", "count": 140 },
            { "name": "2 star", "count": 150 },
            { "name": "3 star", "count": 280 },
            { "name": "4 star", "count": 550 },
            { "name": "5 star", "count": 1510 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/MksD6kMH/MindEase.jpg",
        "title": "MindEase",
        "companyName": "TranquilTech",
        "id": 27,
        "description": "A pocket companion for calm. Check in with your mood, then pick meditations, breathing, or sleep stories tuned to how you feel. Streaks and gentle reminders help build routine. Soundscapes adapt to block noise without headphones. SOS exercises guide you through tough moments in under two minutes. Journaling prompts pair with sessions so insights stick. Progress shows trends in stress and focus over time. A pocket companion for calm. Check in with your mood, then pick meditations, breathing, or sleep stories tuned to how you feel. Streaks and gentle reminders help build routine. Soundscapes adapt to block noise without headphones. SOS exercises guide you through tough moments in under two minutes. Journaling prompts pair with sessions so insights stick. Progress shows trends in stress and focus over time.",
        "size": 122,
        "reviews": 1750,
        "ratingAvg": 4.7,
        "downloads": 40,
        "ratings": [
            { "name": "1 star", "count": 85 },
            { "name": "2 star", "count": 100 },
            { "name": "3 star", "count": 230 },
            { "name": "4 star", "count": 480 },
            { "name": "5 star", "count": 855 }
        ]
    },
    {
        "image": "https://i.ibb.co.com/0j78P6JQ/Weather-IQ.jpg",
        "title": "WeatherIQ",
        "companyName": "SkyNet Systems",
        "id": 28,
        "description": "Hyper-local weather that helps you plan the hour and the week. Minute-by-minute rain and snow nowcasts show when to leave and what to pack. Map layers visualize air quality, UV, wind, and storms. Smart notifications warn about lightning, heat, and floods before they hit. Widgets make info glanceable on your home screen. Outdoor modes tailor forecasts for running, cycling, or photography. Privacy-first settings keep location data on device unless you opt in. Hyper-local weather that helps you plan the hour and the week. Minute-by-minute rain and snow nowcasts show when to leave and what to pack. Map layers visualize air quality, UV, wind, and storms. Smart notifications warn about lightning, heat, and floods before they hit. Widgets make info glanceable on your home screen. Outdoor modes tailor forecasts for running, cycling, or photography. Privacy-first settings keep location data on device unless you opt in.",
        "size": 104,
        "reviews": 1290,
        "ratingAvg": 4.5,
        "downloads": 48,
        "ratings": [
            { "name": "1 star", "count": 70 },
            { "name": "2 star", "count": 100 },
            { "name": "3 star", "count": 220 },
            { "name": "4 star", "count": 430 },
            { "name": "5 star", "count": 470 }
        ]
    }
]
